Revit 2024 API
ControlledApplication.Product Property
 The product type for the current session of Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ProductType Product { get; }
Visual Basic
Public ReadOnly Property Product As ProductType
	Get
Visual C++
public:
property ProductType Product {
	ProductType get ();
}
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace